Tekla Open API Reference for Tekla Structures 2025
ControlLine Properties
The ControlLine type exposes the following members.
Properties
Name | Description
Color
 The color of the control line.
Extension
 The extension of the control line.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Determines whether the line is magnetic or not.
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Line
 The line segment defining the position of the control line.
LineType
 The line type of the control line.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Top
See Also
Reference
ControlLine Class
Tekla.Structures.Model Namespace